
Процедура ПриЗаписи(Отказ)
	//
	//Если ДополнительныеСвойства.Свойство("НовыйЭлемент") Тогда
	//	
	//	ТекстКомментария = "";
	//	ПроверитьКод = Ложь;	 
	//	ГруппаЗагруженоИзJIRA = Справочники.Ошибки.ЗагруженоИзJIRA;	
	//	
	//	Если Родитель = ГруппаЗагруженоИзJIRA И ПроверитьТекстКода И ЗначениеЗаполнено(ПроверяющийТекстКода) Тогда
	//		ТекстКомментария = СтрШаблон("Вы назначены проверящим текста кода в задаче ""%1""",Наименование);	
	//		Пользователь = ПроверяющийТекстКода; 
	//		ПроверитьКод = Истина;
	//	ИначеЕсли Родитель <> ГруппаЗагруженоИзJIRA Тогда	
	//		Пользователь = Справочники.Пользователи.УстановитьОтветственногоПоПользователюИБ();
	//		ТекстКомментария = СтрШаблон("Пользователь ""%1"" создал новую тему ""%2""",Пользователь,Наименование);
	//	КонецЕсли;
	//	
	//	Если ЗначениеЗаполнено(ТекстКомментария) Тогда
	//		ДанныеВыборки = ПолучитьПользователей(ПроверитьКод);
	//		ДобавитьУведомления(Пользователь,Ссылка,ДатаСоздания,ТекстКомментария,ДанныеВыборки);		
	//	КонецЕсли;
	//	
	//	ДополнительныеСвойства.Удалить("НовыйЭлемент");

	//КонецЕсли;
	//
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если Ссылка.Пустая() И НЕ ЭтоГруппа Тогда
		ДополнительныеСвойства.Вставить("НовыйЭлемент",Истина);	
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;	
КонецПроцедуры

Функция ПолучитьПользователей(ПроверитьКод)
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Пользователи.Ссылка КАК Пользователь
	//	|ИЗ
	//	|	Справочник.Пользователи КАК Пользователи
	//	|ГДЕ
	//	|	НЕ Пользователи.ПометкаУдаления";
	//Если ПроверитьКод Тогда
	//	Запрос.Текст = Запрос.Текст + "	И Пользователи.Ссылка = &Ссылка";
	//	Запрос.УстановитьПараметр("Ссылка",ПроверяющийТекстКода); 
	//КонецЕсли;	
	//
	//Возврат Запрос.Выполнить();
	
КонецФункции

	