
&НаСервере
Процедура СоздатьОбъектыНаСервере()
	ОбменДаннымиJIRA.СоздатьОбъектыПоДаннымJIRA(Объект.НачалоПериода, Объект.КонецПериода);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОбъекты(Команда)
	Если ПроверитьЗаполнение() Тогда
		СоздатьОбъектыНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Час_14_00 = 60*60*14;
	КонецПериода = НачалоДня(ТекущаяДата()) + Час_14_00;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ДЕНЬНЕДЕЛИ(&Дата) = 1
		|			ТОГДА ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, -3)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, -1)
		|	КОНЕЦ КАК НачалоПериода";

	Запрос.УстановитьПараметр("Дата", КонецПериода);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
		
	Пока РезультатЗапроса.Следующий() Цикл
		Объект.НачалоПериода = РезультатЗапроса.НачалоПериода;
	КонецЦикла;
	Объект.КонецПериода = КонецПериода;
	
КонецПроцедуры
