
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Пользователь", ПолучитьПользователя()));
	ОткрытьФорму("РегистрСведений.Обсуждение.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

&НаСервере
Функция ПолучитьПользователя()
	Возврат Справочники.Пользователи.УстановитьОтветственногоПоПользователюИБ();
КонецФункции
