&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//
	//Элементы.Список.Отображение = ОтображениеТаблицы.ИерархическийСписок;
	//ТекущийПользователь = Справочники.Пользователи.УстановитьОтветственногоПоПользователюИБ();
	//
	////Отображение Светло-Зеленным цветом строк на проверку 
	//Оформление = Список.УсловноеОформление.Элементы.Добавить();
	//
	//Отбор = Оформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//Отбор.Использование = Истина;
	//Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроверяющийТекстКода");
	//Отбор.ПравоеЗначение = ТекущийПользователь;
	//
	//Отбор = Оформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//Отбор.Использование = Истина;
	//Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроверитьТекстКода");
	//Отбор.ПравоеЗначение = Истина;
	//
	//Отбор = Оформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//Отбор.Использование = Истина;
	//Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Замечание");
	//Отбор.ПравоеЗначение = "";
	//
	//ЦветФона = Оформление.Оформление.Элементы.Найти("ЦветФона");
	//ЦветФона.Значение = WebЦвета.БледноЗеленый;
	//ЦветФона.Использование = Истина;
	//
	//Элементы.Список.Отображение = ОтображениеТаблицы.ИерархическийСписок;
	//
	////Отображение Светло-Голубым цветом строк с текущим исполнителем 
	//Оформление = Список.УсловноеОформление.Элементы.Добавить();
	//
	//Отбор = Оформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//Отбор.Использование = Истина;
	//Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИсполнительJIRA");
	//Отбор.ПравоеЗначение = ТекущийПользователь.JiraUserName;
	//
	//ЦветФона = Оформление.Оформление.Элементы.Найти("ЦветФона");
	//ЦветФона.Значение = WebЦвета.ЦианСветлый;
	//ЦветФона.Использование = Истина;
	
КонецПроцедуры
