
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолеКартинки = Параметры.АдресКартинки;
	
	Если Параметры.Свойство("Ключ") Тогда 
		СсылкаВладельца = Параметры.Ключ;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РежимРедактированияКартинки = ВладелецФормы.Элементы.ГруппаЗаголовок.Доступность;
	
	ЭтотОбъект.КоманднаяПанель.Видимость = РежимРедактированияКартинки;
	ЭтотОбъект.Заголовок = ?(РежимРедактированияКартинки = Истина, "Режим редактирования картинки", "Доступен только просмотр картинки. Для изменения картинки нажмите кнопку Включить редактирование на основной форме");
	
КонецПроцедуры

#Область РаботаСИзображением
&НаКлиенте
Процедура ЗагрузитьКартинку(Команда)
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьКартинкуЗавершение", ЭтотОбъект);
	
	НачатьПомещениеФайла(Оповещение,,,Истина,УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКартинкуЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДаполнительныеПараметры) Экспорт

	Если не Результат Тогда 
		Возврат;
	КонецЕсли;
	
	ПолеКартинки = Адрес;
	ЭтотОбъект.Модифицированность = Истина;
	ИмяФайла = ВыбранноеИмяФайла; 

КонецПроцедуры // ЗагрузитьКартинкуЗавершение()

&НаКлиенте
Процедура УдалитьКартинку(Команда)
	
	ПолеКартинки = "";
	ИмяФайла = "";
	ЭтотОбъект.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЭтотОбъект.Модифицированность = Ложь;
	
	ВладелецФормы.Модифицированность = Истина;
	ВладелецФормы.Параметры.АдресКартинки = ПолеКартинки;
	
	Если ЗначениеЗаполнено(ИмяФайла) Тогда 
		#Если НЕ ВебКлиент Тогда 
			ДвДанныеКартинки = Новый ДвоичныеДанные(ИмяФайла);
			ВладелецФормы.Параметры.ДанныеКартинки = ФайлСервер(ДвДанныеКартинки);
		#Иначе
			ПомещаемыеФайлы = Новый Массив;
			ПомещаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ИмяФайла, ПолеКартинки));
			ВладелецФормы.Параметры.ДанныеКартинки = ФайлСервер(ПомещаемыеФайлы, Истина);
		#КонецЕсли   
	КонецЕсли;

	Закрыть(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьИЗакрыть(Команда)
	
	ЭтотОбъект.Модифицированность = Ложь;
	Закрыть(Ложь);
	
КонецПроцедуры

&НаСервере 
Функция ФайлСервер(Данные, ЭтоВебКлиент = Ложь)  
	
    Если ЭтоВебКлиент Тогда
        АдресПрикрепленныйФайл = Данные[0].Хранение;
        ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресПрикрепленныйФайл);
    Иначе
        ДвоичныеДанные = Данные;
    КонецЕсли;

	Возврат Base64Строка(ДвоичныеДанные);
	
КонецФункции
#КонецОбласти

