
Функция УстановитьОтветственногоПоПользователюИБ() Экспорт

	ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	ТекПользователь = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторИБ", Строка(ПользовательИБ.УникальныйИдентификатор));
	
	Если не ТекПользователь.Пустая() Тогда
		Возврат ТекПользователь;
	Иначе
		нПользователь = Справочники.Пользователи.СоздатьЭлемент();
		нПользователь.Наименование = ПользовательИБ.Имя;
		нПользователь.ИдентификаторИБ = Строка(ПользовательИБ.УникальныйИдентификатор);
	 	нПользователь.Записать();
		Возврат нПользователь.Ссылка;
	КонецЕсли;

КонецФункции // УстановитьОтветственногоПоПользователюИБ()
